In [154]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series([4,3,23,32,4,29],index=['a','b','c','d','e','f'])

In [7]:
obj1 = {'California':1020,'Ohio':5000,'Massachusetts':3939}

In [11]:
pd.Series(obj1)

California       1020
Ohio             5000
Massachusetts    3939
dtype: int64

In [17]:
states = ['Ohio','Massachusetts','Colorado']

In [20]:
pd.Series(obj1,index=states)

Ohio             5000.0
Massachusetts    3939.0
Colorado            NaN
dtype: float64

In [21]:
pd.isnull(pd.Series(obj1,index=states))

Ohio             False
Massachusetts    False
Colorado          True
dtype: bool

In [36]:
gabe = {'hey':123,'jimmy':827,'john':np.nan}

In [37]:
gabe

{'hey': 123, 'jimmy': 827, 'john': nan}

In [39]:
pd.isnull(pd.Series(gabe))

hey      False
jimmy    False
john      True
dtype: bool

In [43]:
pd.Series(gabe).index = ['this','is','new']

In [46]:
gaben = pd.Series(gabe)

In [48]:
gaben.index = ['this','is','new']

In [101]:
data = {
    'state':['Ohio','Missouri','Hawaii','Vermont','New Hampshire']
    ,'year':[2000,2001,2003,2005,2010]
    ,'pop':[1500,20,7500,8000,420]
}

In [102]:
data

{'state': ['Ohio', 'Missouri', 'Hawaii', 'Vermont', 'New Hampshire'],
 'year': [2000, 2001, 2003, 2005, 2010],
 'pop': [1500, 20, 7500, 8000, 420]}

In [103]:
frame = pd.DataFrame(data,columns=['year','state','pop'])

In [104]:
frame[['pop','year']]

    pop  year
0  1500  2000
1    20  2001
2  7500  2003
3  8000  2005
4   420  2010

In [107]:
pd.DataFrame(frame).index = ['a','b','c','d','e']

In [110]:
frame.columns = ['years','states','population']

In [111]:
frame

   years         states  population
a   2000           Ohio        1500
b   2001       Missouri          20
c   2003         Hawaii        7500
d   2005        Vermont        8000
e   2010  New Hampshire         420

In [116]:
frame.loc[['a','c']]

   years  states  population
a   2000    Ohio        1500
c   2003  Hawaii        7500

In [119]:
frame.iloc[0]

years         2000
states        Ohio
population    1500
Name: a, dtype: object

In [122]:
frame['debt'] = np.arange(5)

In [132]:
frame['income'] = np.random.rand(5)

In [151]:
frame['happiness'] = np.random.randint(10,size=5)

In [152]:
frame

   years         states  population  debt    income  happiness
a   2000           Ohio        1500     0  0.232756          7
b   2001       Missouri          20     1  0.122247          3
c   2003         Hawaii        7500     2  0.729040          8
d   2005        Vermont        8000     3  0.717629          9
e   2010  New Hampshire         420     4  0.721629          5

In [153]:
frame.T

                   a         b        c         d              e
years           2000      2001     2003      2005           2010
states          Ohio  Missouri   Hawaii   Vermont  New Hampshire
population      1500        20     7500      8000            420
debt               0         1        2         3              4
income      0.232756  0.122247  0.72904  0.717629       0.721629
happiness          7         3        8         9              5

In [184]:
names = pd.Series(['jake','john','larry'],index=[4,5,6])

In [185]:
ages = {31,44,57}

In [187]:
names.index=ages

In [188]:
names

57     jake
44     john
31    larry
dtype: object

In [195]:
names =pd.DataFrame(names,columns=['names'])

In [209]:
names = names.reset_index()

In [214]:
pd.DataFrame(data)

           state  year   pop
0           Ohio  2000  1500
1       Missouri  2001    20
2         Hawaii  2003  7500
3        Vermont  2005  8000
4  New Hampshire  2010   420

In [217]:
frame = pd.DataFrame(data,columns=['state','year','pop','debt'])

In [219]:
frame[['state','year']]

           state  year
0           Ohio  2000
1       Missouri  2001
2         Hawaii  2003
3        Vermont  2005
4  New Hampshire  2010

In [225]:
frame.loc[1]

state    Missouri
year         2001
pop            20
debt          NaN
Name: 1, dtype: object

In [228]:
frame['debt'] = np.random.randint(10,size=5)

In [229]:
frame

           state  year   pop  debt
0           Ohio  2000  1500     1
1       Missouri  2001    20     6
2         Hawaii  2003  7500     0
3        Vermont  2005  8000     9
4  New Hampshire  2010   420     8

In [230]:
frame['debt'] = np.arange(5)

In [231]:
frame

           state  year   pop  debt
0           Ohio  2000  1500     0
1       Missouri  2001    20     1
2         Hawaii  2003  7500     2
3        Vermont  2005  8000     3
4  New Hampshire  2010   420     4

In [234]:
frame['debt'] = pd.Series([-1.7,3,-16],index=[1,3,4])

In [235]:
frame

           state  year   pop  debt
0           Ohio  2000  1500   NaN
1       Missouri  2001    20  -1.7
2         Hawaii  2003  7500   NaN
3        Vermont  2005  8000   3.0
4  New Hampshire  2010   420 -16.0

In [259]:
cols = frame.columns.to_list()

In [263]:
cols = ['state', 'pop', 'debt', 'year', 'eastern']

In [267]:
frame.reindex(columns=cols)

           state   pop  debt  year  eastern
0           Ohio  1500   NaN  2000     True
1       Missouri    20  -1.7  2001    False
2         Hawaii  7500   NaN  2003    False
3        Vermont  8000   3.0  2005    False
4  New Hampshire   420 -16.0  2010    False

In [265]:
frame

           state  year   pop  debt  eastern
0           Ohio  2000  1500   NaN     True
1       Missouri  2001    20  -1.7    False
2         Hawaii  2003  7500   NaN    False
3        Vermont  2005  8000   3.0    False
4  New Hampshire  2010   420 -16.0    False

In [273]:
frame['eastern'] = frame.state == 'Ohio'

In [274]:
frame

           state  year   pop  debt  eastern
0           Ohio  2000  1500   NaN     True
1       Missouri  2001    20  -1.7    False
2         Hawaii  2003  7500   NaN    False
3        Vermont  2005  8000   3.0    False
4  New Hampshire  2010   420 -16.0    False

In [275]:
pd.Series(np.arange(3))

0    0
1    1
2    2
dtype: int32

In [277]:
labels = pd.Index(np.arange(3))

In [279]:
obj = pd.Series([0,-1.2,4],index=labels)

In [282]:
obj.index is labels

True

In [284]:
labels = pd.Index(np.random.randint(10,size=10))

In [309]:
obj2 = pd.Series([2,54,3,4,23,4,3,2,3,4],index=labels)

In [310]:
obj2 = pd.DataFrame(obj2)

In [316]:
obj = pd.Series([4.5,4.2,6.7,-8.2],index=['d','a','b','c'])

In [321]:
obj2 = obj.reindex(['d','g','c','f'])

In [322]:
obj2

d    4.5
g    NaN
c   -8.2
f    NaN
dtype: float64

In [334]:
obj3 = pd.Series(['hey','now','gabey'],index=[2,3,9])

In [340]:
obj4 = obj3.reindex(range(11),method='ffill')

In [341]:
obj4

0       NaN
1       NaN
2       hey
3       now
4       now
5       now
6       now
7       now
8       now
9     gabey
10    gabey
dtype: object

In [342]:
obj4.drop([0,1])

2       hey
3       now
4       now
5       now
6       now
7       now
8       now
9     gabey
10    gabey
dtype: object

In [350]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),columns=['California','Utah','Vermont'],index=['a','b','d'])

In [368]:
frame = frame.reindex(['a','b','c','d'])

In [384]:
frame.iloc[2] = ['Jim','Jake','John']

In [392]:
frame.loc['c'] = np.NaN

In [393]:
frame

  California Utah Vermont
a          0    1       2
b          3    4       5
c        NaN  NaN     NaN
d          6    7       8

In [396]:
frame.drop('c')

  California Utah Vermont
a          0    1       2
b          3    4       5
d          6    7       8

In [398]:
frame.drop(['c'])

  California Utah Vermont
a          0    1       2
b          3    4       5
d          6    7       8

In [399]:
frame

  California Utah Vermont
a          0    1       2
b          3    4       5
c        NaN  NaN     NaN
d          6    7       8

In [401]:
frame.drop('Utah',axis=1)

  California Vermont
a          0       2
b          3       5
c        NaN     NaN
d          6       8

In [410]:
frame

  California Utah Vermont
a          0    1       2
b          3    4       5
c        NaN  NaN     NaN
d          6    7       8

In [432]:
frame.loc['c'] = [0]

In [433]:
frame

  California Utah Vermont
a          0    1       2
b          3    4       5
c          0    0       0
d          6    7       8

In [466]:
frame.loc[frame['Utah'] < frame['Vermont']]

  California Utah Vermont
a          0    1       2
b          3    4       5
d          6    7       8

In [477]:
frame.loc[frame['Utah'] > 1],frame.loc[frame['Vermont'] > 5]

(  California Utah Vermont
 b          3    4       5
 d          6    7       8,   California Utah Vermont
 d          6    7       8)

In [484]:
frame.loc[['a','b'],['California']]

  California
a          0
b          3

In [485]:
frame.iloc[[0,1],[0]]

  California
a          0
b          3

In [486]:
frame.loc[frame['California']>0]

  California Utah Vermont
b          3    4       5
d          6    7       8

In [497]:
frame.iat[1,2]

5.0

In [498]:
frame.at['b','Vermont']

5.0

In [499]:
frame.loc['b','Vermont']

5.0

In [503]:
ser = pd.Series(np.arange(4),index=['a','b','c','d'])

In [515]:
ser[2:]

c    2
d    3
dtype: int32

In [516]:
ser[-1]

3

In [517]:
ser

a    0
b    1
c    2
d    3
dtype: int32

In [518]:
ser[1]

1

In [533]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))

In [536]:
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))

In [537]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [548]:
df2.iloc[2,1] = np.NaN

In [549]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0   NaN  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [550]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0   NaN  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [555]:
df1.add(df2,fill_value=100)

       a      b      c      d      e
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0  109.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [560]:
obj = pd.Series(range(4),index=['a','c','d','b'])

In [561]:
obj

a    0
c    1
d    2
b    3
dtype: int64

In [562]:
obj.sort_index()

a    0
b    3
c    1
d    2
dtype: int64

In [578]:
obj = pd.DataFrame(np.arange(8).reshape((2,4)),columns=['a','c','d','b'])

In [582]:
obj.sort_index(axis=1)

   a  b  c  d
0  0  3  1  2
1  4  7  5  6

In [626]:
bats = pd.DataFrame(np.random.randint(5,size=15).reshape(5,3),index=['gabe','jim','john','kaylee','sasha'],columns=['one','two','three'])

In [629]:
bats.sort_values(by='two')

        one  two  three
jim       1    1      3
john      1    1      3
gabe      0    2      3
kaylee    3    2      0
sasha     0    3      2

In [632]:
bats.loc['jim']

one      1
two      1
three    3
Name: jim, dtype: int32

In [640]:
bats

        one  two  three
gabe      0    2      3
jim       1    1      3
john      1    1      3
kaylee    3    2      0
sasha     0    3      2

In [661]:
obj = pd.Series([3,2,0,-5,2])

In [667]:
obj

0    3
1    2
2    0
3   -5
4    2
dtype: int64

In [672]:
obj.rank(ascending=True)

0    5.0
1    3.5
2    2.0
3    1.0
4    3.5
dtype: float64

In [675]:
obj.rank(method='average')

0    5.0
1    3.5
2    2.0
3    1.0
4    3.5
dtype: float64

In [676]:
obj.index.is_unique

True

In [679]:
obj.sum()

2